Bayerdevponomarev.RA_Divisions/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>RA_AdditionalFields_Region</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_Regions</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_SearchTerm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_TradingPartner</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_TradingPartners</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодEcom_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодEcom_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_IDEcom_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_IDEcom_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>RA_AdditionalFields_СписокГрузополучателей</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Bayerdevponomarev.RA_Divisions/src/Catalogs/Партнеры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	RA_AdditionalFields_ДобавитьЭлементыНаФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_ДобавитьЭлементыНаФорму()
	
	//Добавим группу Bayer
	ГруппаBayer = Элементы.Вставить("РА_ГруппаBayer", Тип("ГруппаФормы"), Элементы.ГруппаОбщаяИнформация, Элементы.ГруппаОтношенияДополнительно);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check bsl-legacy-check-expression-type
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина;
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "Bayer";
	//@skip-check bsl-legacy-check-expression-type
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаBayer.Поведение = ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаBayer.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаBayer.Скрыть();

	НовыйЭлемент = Элементы.Добавить("RA_КодSAP_Vendor", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодSAP_Vendor";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_КодSAP_Customer", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодSAP_Customer";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_КодEcom_Vendor", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодEcom_Vendor";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_КодEcom_Customer", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодEcom_Customer";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_IDEcom_Vendor", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_IDEcom_Vendor";
	НовыйЭлемент.Ширина = 27;
		
	НовыйЭлемент = Элементы.Добавить("RA_IDEcom_Customer", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_IDEcom_Customer";
	НовыйЭлемент.Ширина = 27;
			
	НовыйЭлемент = Элементы.Добавить("RA_TradingPartner", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_TradingPartner";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_SearchTerm", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_SearchTerm";
	НовыйЭлемент.Ширина = 27;
	
	НовыйЭлемент = Элементы.Добавить("RA_Region", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_Region";
	НовыйЭлемент.Ширина = 27;
	
КонецПроцедуры

#КонецОбласти
